In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
passengers = pd.read_csv("data/air-passenger-arrivals-by-country-of-embarkation.csv")

In [3]:
passengers.head()

,month,level_1,level_2,level_3,value
0,1961-01,Number Of Air Passenger Arrivals,South East Asia,Malaysia,na
1,1961-01,Number Of Air Passenger Arrivals,South East Asia,Indonesia,1687
2,1961-01,Number Of Air Passenger Arrivals,South East Asia,Thailand,1172
3,1961-01,Number Of Air Passenger Arrivals,South East Asia,Philippines,139
4,1961-01,Number Of Air Passenger Arrivals,South East Asia,Vietnam,na

In [4]:
passengers = pd.read_csv("data/air-passenger-arrivals-by-country-of-embarkation.csv", na_values=["na", "-"],
                        names=["year-month", "total", "region", "country", "value"], header=0)

In [5]:
passengers.groupby("country")["value"].sum().sort_values(ascending=False)

country
Malaysia          64924645.0
Indonesia         63995595.0
Thailand          50736256.0
Hong Kong         35468033.0
Japan             30487564.0
China             29866493.0
Philippines       18466360.0
United Kingdom    17950341.0
Vietnam           11064922.0
Germany            8438001.0
France             4462481.0
Name: value, dtype: float64

In [6]:
passengers[passengers["year-month"] == "2017-01"]

,year-month,total,region,country,value
7392,2017-01,Number Of Air Passenger Arrivals,South East Asia,Malaysia,259314.0
7393,2017-01,Number Of Air Passenger Arrivals,South East Asia,Indonesia,308766.0
7394,2017-01,Number Of Air Passenger Arrivals,South East Asia,Thailand,244080.0
7395,2017-01,Number Of Air Passenger Arrivals,South East Asia,Philippines,139796.0
7396,2017-01,Number Of Air Passenger Arrivals,South East Asia,Vietnam,98670.0
7397,2017-01,Number Of Air Passenger Arrivals,North East Asia,China,296317.0
7398,2017-01,Number Of Air Passenger Arrivals,North East Asia,Hong Kong,161089.0
7399,2017-01,Number Of Air Passenger Arrivals,North East Asia,Japan,109393.0
7400,2017-01,Number Of Air Passenger Arrivals,Europe,United Kingdom,52431.0
7401,2017-01,Number Of Air Passenger Arrivals,Europe,France,18160.0
7402,2017-01,Number Of Air Passenger Arrivals,Europe,Germany,32906.0

In [7]:
passengers_201701 = passengers[passengers["year-month"] == "2017-01"]

In [8]:
passengers_201701.sort_values(by="value", ascending=False)

,year-month,total,region,country,value
7393,2017-01,Number Of Air Passenger Arrivals,South East Asia,Indonesia,308766.0
7397,2017-01,Number Of Air Passenger Arrivals,North East Asia,China,296317.0
7392,2017-01,Number Of Air Passenger Arrivals,South East Asia,Malaysia,259314.0
7394,2017-01,Number Of Air Passenger Arrivals,South East Asia,Thailand,244080.0
7398,2017-01,Number Of Air Passenger Arrivals,North East Asia,Hong Kong,161089.0
7395,2017-01,Number Of Air Passenger Arrivals,South East Asia,Philippines,139796.0
7399,2017-01,Number Of Air Passenger Arrivals,North East Asia,Japan,109393.0
7396,2017-01,Number Of Air Passenger Arrivals,South East Asia,Vietnam,98670.0
7400,2017-01,Number Of Air Passenger Arrivals,Europe,United Kingdom,52431.0
7402,2017-01,Number Of Air Passenger Arrivals,Europe,Germany,32906.0
7401,2017-01,Number Of Air Passenger Arrivals,Europe,France,18160.0

In [9]:
passengers.groupby("year-month").sum().sort_values(by="value", ascending=False).head(5)

                value
year-month
2016-12     1813414.0
2016-07     1747537.0
2017-01     1720922.0
2017-03     1712386.0
2015-12     1710942.0

In [11]:
passengers[passengers["value"] > 100000]["country"].value_counts() # Which countries have the most number of months with arrivals > 100000

Malaysia       311
Indonesia      269
Thailand       225
China          144
Hong Kong      108
Japan           51
Philippines     45
Vietnam          5
Name: country, dtype: int64

In [12]:
passengers["year"] = passengers["year-month"].apply(lambda x: int(x.split("-")[0]))

In [13]:
passengers["month"] = passengers["year-month"].apply(lambda x: int(x.split("-")[1]))

In [14]:
passengers.head()

,year-month,total,region,country,value,year,month
0,1961-01,Number Of Air Passenger Arrivals,South East Asia,Malaysia,NaN,1961,1
1,1961-01,Number Of Air Passenger Arrivals,South East Asia,Indonesia,1687.0,1961,1
2,1961-01,Number Of Air Passenger Arrivals,South East Asia,Thailand,1172.0,1961,1
3,1961-01,Number Of Air Passenger Arrivals,South East Asia,Philippines,139.0,1961,1
4,1961-01,Number Of Air Passenger Arrivals,South East Asia,Vietnam,NaN,1961,1

In [15]:
# Sort descending by value

In [16]:
passengers.groupby("month").mean()

              value    year
month
1      54484.202729  1989.0
2      52060.263158  1989.0
3      56602.124756  1989.0
4      51791.027888  1988.5
5      50962.653386  1988.5
6      57080.749004  1988.5
7      57530.515936  1988.5
8      57577.836653  1988.5
9      53150.388446  1988.5
10     55514.668663  1988.5
11     55295.302789  1988.5
12     63531.129482  1988.5

In [17]:
passengers.groupby("month")["value"].mean().sort_values(ascending=False)

month
12    63531.129482
8     57577.836653
7     57530.515936
6     57080.749004
3     56602.124756
10    55514.668663
11    55295.302789
1     54484.202729
9     53150.388446
2     52060.263158
4     51791.027888
5     50962.653386
Name: value, dtype: float64